app/views/topics/index.html.erb

        <td><%= link_to topic.title, topic %></td>
        <td><%= pluralize(topic.votes.count, "vote") %></td>
        <td><%= pluralize(topic.downvotes.count, "downvote") %></td>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."topic_id" = ?  [["topic_id", 1]]
SELECT COUNT(*) FROM "downvotes" WHERE "downvotes"."topic_id" = ?  [["topic_id", 1]]