app/controllers/comments_controller.rb

  def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(comment_params)
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "jijo"], ["body", "ssdd"], ["topic_id", 2], ["created_at", 2016-12-26 12:51:05 UTC], ["updated_at", 2016-12-26 12:51:05 UTC]]

  def destroy
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.find(params[:id])
    @comment.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT ?  [["topic_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]