app/controllers/topics_controller.rb

INSERT INTO "topics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Blog"], ["description", "contents here\r\n"], ["created_at", 2016-12-25 15:15:58 UTC], ["updated_at", 2016-12-25 15:15:58 UTC]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

UPDATE "topics" SET "title" = ?, "updated_at" = ? WHERE "topics"."id" = ?  [["title", "My First Blog post"], ["updated_at", 2016-12-26 14:04:35 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @topic.update(topic_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 1], ["created_at", 2016-12-25 15:24:54 UTC], ["updated_at", 2016-12-25 15:24:54 UTC]]
---
  def upvote
    @topic = Topic.find(params[:id])
    @topic.votes.create

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "downvotes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 1], ["created_at", 2016-12-25 15:25:34 UTC], ["updated_at", 2016-12-25 15:25:34 UTC]]
---
  def downvote
    @topic = Topic.find(params[:id])
    @topic.downvotes.create